wolfSSL/wolfip/src/port/stm32h753/main.c
/* main.c
 *
 * STM32H753ZI wolfIP Echo Server / TLS Client
 *
 * Copyright (C) 2024 wolfSSL Inc.
 *
 * This file is part of wolfIP TCP/IP stack.
 */
#include <stdint.h>
#include <string.h>
#include "config.h"
#include "wolfip.h"
#include "stm32h7_eth.h"

#ifdef ENABLE_TLS
#include "tls_client.h"
#define TLS_PORT 8443
#endif

#ifdef ENABLE_HTTPS
#include "http/httpd.h"
#include "certs.h"
#define HTTPS_WEB_PORT 443
#endif

/* Test server for TLS client (Google) */
#ifdef ENABLE_TLS
#define GOOGLE_IP "142.250.189.174"
#define GOOGLE_HTTPS_PORT 443
static int tls_client_test_started = 0;
static int tls_client_test_done = 0;
#endif

#define ECHO_PORT 7
#define RX_BUF_SIZE 1024

/* =========================================================================
 * STM32H753ZI Register Definitions
 * ========================================================================= */

/* RCC (Reset and Clock Control) - APB4 */
#define RCC_BASE            0x58024400UL
#define RCC_CR              (*(volatile uint32_t *)(RCC_BASE + 0x00))
#define RCC_HSICFGR         (*(volatile uint32_t *)(RCC_BASE + 0x04))
#define RCC_CRRCR           (*(volatile uint32_t *)(RCC_BASE + 0x08))
#define RCC_CFGR            (*(volatile uint32_t *)(RCC_BASE + 0x10))
#define RCC_D1CFGR          (*(volatile uint32_t *)(RCC_BASE + 0x18))
#define RCC_D2CFGR          (*(volatile uint32_t *)(RCC_BASE + 0x1C))
#define RCC_D3CFGR          (*(volatile uint32_t *)(RCC_BASE + 0x20))
#define RCC_PLLCKSELR       (*(volatile uint32_t *)(RCC_BASE + 0x28))
#define RCC_PLLCFGR         (*(volatile uint32_t *)(RCC_BASE + 0x2C))
#define RCC_PLL1DIVR        (*(volatile uint32_t *)(RCC_BASE + 0x30))
#define RCC_PLL1FRACR       (*(volatile uint32_t *)(RCC_BASE + 0x34))
#define RCC_AHB1ENR         (*(volatile uint32_t *)(RCC_BASE + 0xD8))
#define RCC_AHB2ENR         (*(volatile uint32_t *)(RCC_BASE + 0xDC))
#define RCC_AHB4ENR         (*(volatile uint32_t *)(RCC_BASE + 0xE0))
#define RCC_APB1LENR        (*(volatile uint32_t *)(RCC_BASE + 0xE8))
#define RCC_APB4ENR         (*(volatile uint32_t *)(RCC_BASE + 0xF4))
#define RCC_AHB1RSTR        (*(volatile uint32_t *)(RCC_BASE + 0x80))
#define RCC_AHB1RSTR_ETHRST (1u << 15)  /* ETH1MACRST is bit 15, NOT 25 */

/* RCC_CR bits */
#define RCC_CR_HSION        (1u << 0)
#define RCC_CR_HSIRDY       (1u << 2)
#define RCC_CR_HSEON        (1u << 16)
#define RCC_CR_HSERDY       (1u << 17)
#define RCC_CR_HSEBYP       (1u << 18)
#define RCC_CR_PLL1ON       (1u << 24)
#define RCC_CR_PLL1RDY      (1u << 25)

/* RCC_CFGR bits */
#define RCC_CFGR_SW_HSI     (0u << 0)
#define RCC_CFGR_SW_HSE     (2u << 0)
#define RCC_CFGR_SW_PLL1    (3u << 0)
#define RCC_CFGR_SW_MASK    (7u << 0)
#define RCC_CFGR_SWS_MASK   (7u << 3)
#define RCC_CFGR_SWS_PLL1   (3u << 3)

/* PWR (Power Control) */
#define PWR_BASE            0x58024800UL
#define PWR_CR3             (*(volatile uint32_t *)(PWR_BASE + 0x0C))
#define PWR_CR3_LDOEN       (1u << 1)
#define PWR_CR3_SCUEN       (1u << 2)
#define PWR_D3CR            (*(volatile uint32_t *)(PWR_BASE + 0x18))
#define PWR_D3CR_VOSRDY     (1u << 13)
#define PWR_D3CR_VOS_MASK   (3u << 14)
#define PWR_D3CR_VOS_SCALE1 (3u << 14)

/* RCC APB4ENR bits */
#define RCC_APB4ENR_PWREN   (1u << 4)

/* Flash */
#define FLASH_BASE          0x52002000UL
#define FLASH_ACR           (*(volatile uint32_t *)(FLASH_BASE + 0x00))
#define FLASH_ACR_LATENCY_4WS (4u << 0)
#define FLASH_ACR_WRHIGHFREQ_2 (2u << 4)

/* GPIO base addresses (APB4/AHB4) */
#define GPIOA_BASE          0x58020000UL
#define GPIOB_BASE          0x58020400UL
#define GPIOC_BASE          0x58020800UL
#define GPIOD_BASE          0x58020C00UL
#define GPIOE_BASE          0x58021000UL
#define GPIOF_BASE          0x58021400UL
#define GPIOG_BASE          0x58021800UL

/* GPIO register offsets */
#define GPIO_MODER(base)    (*(volatile uint32_t *)((base) + 0x00))
#define GPIO_OTYPER(base)   (*(volatile uint32_t *)((base) + 0x04))
#define GPIO_OSPEEDR(base)  (*(volatile uint32_t *)((base) + 0x08))
#define GPIO_PUPDR(base)    (*(volatile uint32_t *)((base) + 0x0C))
#define GPIO_IDR(base)      (*(volatile uint32_t *)((base) + 0x10))
#define GPIO_ODR(base)      (*(volatile uint32_t *)((base) + 0x14))
#define GPIO_BSRR(base)     (*(volatile uint32_t *)((base) + 0x18))
#define GPIO_AFRL(base)     (*(volatile uint32_t *)((base) + 0x20))
#define GPIO_AFRH(base)     (*(volatile uint32_t *)((base) + 0x24))

/* SYSCFG for RMII selection */
#define SYSCFG_BASE         0x58000400UL
#define SYSCFG_PMCR         (*(volatile uint32_t *)(SYSCFG_BASE + 0x04))
#define SYSCFG_PMCR_EPIS_RMII (4U << 21)

/* RNG (hardware random number generator) */
#define RNG_BASE            0x48021800UL
#define RNG_CR              (*(volatile uint32_t *)(RNG_BASE + 0x00))
#define RNG_SR              (*(volatile uint32_t *)(RNG_BASE + 0x04))
#define RNG_DR              (*(volatile uint32_t *)(RNG_BASE + 0x08))
#define RNG_CR_RNGEN        (1u << 2)
#define RNG_SR_DRDY         (1u << 0)
#define RNG_SR_CECS         (1u << 1)
#define RNG_SR_SECS         (1u << 2)

/* USART3 for debug output (ST-Link VCP on NUCLEO-H753ZI: PD8=TX, PD9=RX) */
#define USART3_BASE         0x40004800UL
#define USART3_CR1          (*(volatile uint32_t *)(USART3_BASE + 0x00))
#define USART3_CR2          (*(volatile uint32_t *)(USART3_BASE + 0x04))
#define USART3_CR3          (*(volatile uint32_t *)(USART3_BASE + 0x08))
#define USART3_BRR          (*(volatile uint32_t *)(USART3_BASE + 0x0C))
#define USART3_ISR          (*(volatile uint32_t *)(USART3_BASE + 0x1C))
#define USART3_TDR          (*(volatile uint32_t *)(USART3_BASE + 0x28))

/* LED on NUCLEO-H753ZI: PB0 (LD1 Green), PB7 (LD2 Blue), PB14 (LD3 Red) */
#define LED1_PIN 0u   /* PB0 - Green */
#define LED2_PIN 7u   /* PB7 - Blue */
#define LED3_PIN 14u  /* PB14 - Red */

/* =========================================================================
 * HardFault Handler - prints crash info via UART
 * ========================================================================= */
#define SCB_HFSR   (*(volatile uint32_t *)0xE000ED2CUL)
#define SCB_CFSR   (*(volatile uint32_t *)0xE000ED28UL)
#define SCB_BFAR   (*(volatile uint32_t *)0xE000ED38UL)
#define SCB_MMFAR  (*(volatile uint32_t *)0xE000ED34UL)

