wolfSSL/wolfip/src/port/stm32h753/main.c
static void fault_uart_putc(char c)
{
    while ((USART3_ISR & (1u << 7)) == 0) { }
    USART3_TDR = (uint32_t)c;
}
static void fault_uart_puts(const char *s)
{
    while (*s) {
        if (*s == '\n') fault_uart_putc('\r');
        fault_uart_putc(*s++);
    }
}
static void fault_uart_puthex(uint32_t val)
{
    const char hex[] = "0123456789ABCDEF";
    fault_uart_puts("0x");
    for (int i = 28; i >= 0; i -= 4)
        fault_uart_putc(hex[(val >> i) & 0xF]);
}

void hard_fault_handler_c(uint32_t *frame)
{
    fault_uart_puts("\n\n*** HARD FAULT ***\n");
    fault_uart_puts("  PC:   "); fault_uart_puthex(frame[6]); fault_uart_puts("\n");
    fault_uart_puts("  LR:   "); fault_uart_puthex(frame[5]); fault_uart_puts("\n");
    fault_uart_puts("  R0:   "); fault_uart_puthex(frame[0]); fault_uart_puts("\n");
    fault_uart_puts("  R1:   "); fault_uart_puthex(frame[1]); fault_uart_puts("\n");
    fault_uart_puts("  R2:   "); fault_uart_puthex(frame[2]); fault_uart_puts("\n");
    fault_uart_puts("  R3:   "); fault_uart_puthex(frame[3]); fault_uart_puts("\n");
    fault_uart_puts("  R12:  "); fault_uart_puthex(frame[4]); fault_uart_puts("\n");
    fault_uart_puts("  xPSR: "); fault_uart_puthex(frame[7]); fault_uart_puts("\n");
    fault_uart_puts("  HFSR: "); fault_uart_puthex(SCB_HFSR); fault_uart_puts("\n");
    fault_uart_puts("  CFSR: "); fault_uart_puthex(SCB_CFSR); fault_uart_puts("\n");
    if (SCB_CFSR & 0x00008200u) {
        fault_uart_puts("  BFAR: "); fault_uart_puthex(SCB_BFAR); fault_uart_puts("\n");
    }
    if (SCB_CFSR & 0x00000082u) {
        fault_uart_puts("  MMFAR:"); fault_uart_puthex(SCB_MMFAR); fault_uart_puts("\n");
    }
    /* Blink red LED */
    GPIO_BSRR(GPIOB_BASE) = (1u << LED3_PIN);
    while (1) { }
}

void HardFault_Handler(void) __attribute__((naked));
void HardFault_Handler(void)
{
    __asm volatile(
        "tst lr, #4       \n"
        "ite eq            \n"
        "mrseq r0, msp     \n"
        "mrsne r0, psp     \n"
        "b hard_fault_handler_c \n"
    );
}

/* =========================================================================
 * Global Variables
 * ========================================================================= */
static struct wolfIP *IPStack;
static int listen_fd = -1;
static int client_fd = -1;
static uint8_t rx_buf[RX_BUF_SIZE];

/* =========================================================================
 * Helper Functions
 * ========================================================================= */

/* Initialize STM32H7 hardware RNG */
static void rng_init(void)
{
    volatile uint32_t *rcc_cr = (volatile uint32_t *)(RCC_BASE + 0x00);
    volatile uint32_t *rcc_d2ccip2r = (volatile uint32_t *)(RCC_BASE + 0x54);
    uint32_t timeout;

    /* Enable HSI48 oscillator (RNG kernel clock source) */
    *rcc_cr |= (1u << 12);  /* HSI48ON */
    timeout = 100000;
    while (!(*rcc_cr & (1u << 13)) && --timeout) { }  /* Wait HSI48RDY */

    /* Select HSI48 as RNG clock: RCC_D2CCIP2R bits[9:8] = 00 (HSI48) */
    *rcc_d2ccip2r &= ~(3u << 8);

    /* Enable RNG clock (AHB2, bit 6) */
    RCC_AHB2ENR |= (1u << 6);
    /* Small delay for clock to stabilize */
    for (volatile int i = 0; i < 100; i++) { }
    /* Enable RNG */
    RNG_CR = RNG_CR_RNGEN;
}

/* Get one 32-bit random word from hardware RNG */
static int rng_get_word(uint32_t *out)
{
    uint32_t timeout = 10000;
    /* Wait for data ready */
    while ((RNG_SR & RNG_SR_DRDY) == 0) {
        if (--timeout == 0)
            return -1;
        /* Check for errors */
        if (RNG_SR & (RNG_SR_CECS | RNG_SR_SECS)) {
            /* Reset RNG on error */
            RNG_CR = 0;
            for (volatile int i = 0; i < 100; i++) { }
            RNG_CR = RNG_CR_RNGEN;
            timeout = 10000;
        }
    }
    *out = RNG_DR;
    return 0;
}

/* Required by wolfSSL (CUSTOM_RAND_GENERATE_BLOCK) */
int custom_rand_gen_block(unsigned char *output, unsigned int sz)
{
    uint32_t word;
    while (sz >= 4) {
        if (rng_get_word(&word) != 0)
            return -1;
        output[0] = (unsigned char)(word);
        output[1] = (unsigned char)(word >> 8);
        output[2] = (unsigned char)(word >> 16);
        output[3] = (unsigned char)(word >> 24);
        output += 4;
        sz -= 4;
    }
    if (sz > 0) {
        if (rng_get_word(&word) != 0)
            return -1;
        while (sz--) {
            *output++ = (unsigned char)(word);
            word >>= 8;
        }
    }
    return 0;
}

/* Required by wolfIP */
uint32_t wolfIP_getrandom(void)
{
    uint32_t val;
    if (rng_get_word(&val) == 0)
        return val;
    /* Fallback LFSR if HW RNG fails */
    static uint32_t lfsr = 0x1A2B3C4DU;
    lfsr ^= lfsr << 13;
    lfsr ^= lfsr >> 17;
    lfsr ^= lfsr << 5;
    return lfsr;
}

static void delay(uint32_t count)
{
    for (volatile uint32_t i = 0; i < count; i++) { }
}

/* =========================================================================
 * System Clock Configuration (HSE + PLL = 400MHz like SDK)
 *
 * NUCLEO-H753ZI has 8MHz HSE from ST-Link MCO
 * Configure: SYSCLK=400MHz, HCLK=200MHz, APBx=100MHz
 * ========================================================================= */
static int system_clock_config(void)
{
    uint32_t timeout;

    /* 0. Enable PWR clock first */
    RCC_APB4ENR |= RCC_APB4ENR_PWREN;
    __asm volatile ("dsb sy" ::: "memory");
    delay(100);

    /* 1. Ensure LDO is enabled (default after reset, but be sure) */
    PWR_CR3 |= PWR_CR3_LDOEN;
    PWR_CR3 &= ~PWR_CR3_SCUEN;  /* Disable supply configuration update */
    delay(100);

    /* 2. Set voltage scaling to Scale 1 (highest performance) */
    PWR_D3CR = (PWR_D3CR & ~PWR_D3CR_VOS_MASK) | PWR_D3CR_VOS_SCALE1;
    timeout = 100000;
    while (((PWR_D3CR & PWR_D3CR_VOSRDY) == 0) && --timeout) {}
    if (timeout == 0) return -1;

    /* 2. Enable D2 SRAM1/2/3 clocks (ETH DMA buffers are in D2 SRAM1 @ 0x30000000) */
    RCC_AHB2ENR |= (1u << 29) | (1u << 30) | (1u << 31);

