wolfSSL/wolfip/src/port/stm32h753/main.c
    /* Early UART init at 64MHz HSI for debugging */
    uart_init_early();
    uart_puts("\n\n=== Clock Config Debug ===\n");
    uart_puts("Running at 64MHz HSI...\n");
    uart_puts("Configuring HSE + PLL (400MHz)...\n");

    /* Configure system clock: HSE + PLL -> 400MHz SYSCLK, 200MHz HCLK */
    ret = system_clock_config();
    if (ret != 0) {
        /* Clock config failed - print error and blink red LED */
        uart_puts("CLOCK CONFIG FAILED! Error: ");
        uart_puthex((uint32_t)ret);
        uart_puts("\n");
        led_red_on();
        while (1) {
            led_red_on();
            delay(500000);
            led_red_off();
            delay(500000);
        }
    }

    /* Reconfigure UART for 100MHz APB1 */
    uart_reconfigure();
    uart_puts("Clock config OK! Now at 400MHz SYSCLK, 200MHz HCLK\n");

    /* Short blink to indicate clock config success */
    led_green_off();
    delay(100000);
    led_green_on();
    led_blue_off();
    led_red_off();

    /* Blink to show UART init done */
    led_green_off();
    delay(200000);
    led_green_on();
    delay(200000);
    led_green_off();
    delay(200000);
    led_green_on();

    /* Initialize hardware RNG */
    rng_init();
    {
        uint32_t rng_test;
        int rng_ok = rng_get_word(&rng_test);
        uart_puts("RNG init: ");
        uart_puts(rng_ok == 0 ? "OK" : "FAILED");
        if (rng_ok == 0) {
            uart_puts(" val="); uart_puthex(rng_test);
        }
        uart_puts("\n");
    }

    uart_puts("\n\n=== wolfIP STM32H753ZI Echo Server ===\n");

    /* Read chip revision - critical for errata */
    uart_puts("Chip ID:\n");
    {
        volatile uint32_t *dbgmcu_idc = (volatile uint32_t *)(0x5C001000UL);
        uint32_t idc = *dbgmcu_idc;
        uart_puts("  DBGMCU_IDCODE: "); uart_puthex(idc); uart_puts("\n");
        uart_puts("  DEV_ID: "); uart_puthex(idc & 0xFFF);
        uart_puts(" REV_ID: "); uart_puthex((idc >> 16) & 0xFFFF);
        uart_puts("\n");
    }

    /* Dump clock prescaler config */
    uart_puts("Clock prescalers:\n");
    uart_puts("  RCC_D1CFGR: "); uart_puthex(*(volatile uint32_t *)(RCC_BASE + 0x18));
    uart_puts("\n");
    uart_puts("  RCC_D2CFGR: "); uart_puthex(*(volatile uint32_t *)(RCC_BASE + 0x1C));
    uart_puts("\n");
    uart_puts("  RCC_D3CFGR: "); uart_puthex(*(volatile uint32_t *)(RCC_BASE + 0x20));
    uart_puts("\n");

    uart_puts("Initializing wolfIP stack...\n");
    wolfIP_init_static(&IPStack);

    /* ================================================================
     * ETH Init: GPIO/SYSCFG first, then wait for PHY, then clocks.
     *
     * The LAN8742A PHY needs up to 167ms after hardware reset (which
     * is tied to NRST on the Nucleo board) to start outputting a
     * stable 50MHz REF_CLK. We must wait for this before enabling
     * the ETH MAC clocks, since the MAC's register interface won't
     * respond without a valid reference clock.
     *
     * Also enable the SYSCFG I/O compensation cell (required for
     * BOOSTE to take effect per RM0433).
     * ================================================================ */

    /* Step 1: Configure GPIO + SYSCFG RMII mode */
    uart_puts("Configuring GPIO for RMII...\n");
    eth_gpio_init();

    /* Verify GPIO config IMMEDIATELY after eth_gpio_init() */
    uart_puts("GPIO verification (after eth_gpio_init):\n");
    {
        uint32_t moder_a = GPIO_MODER(GPIOA_BASE);
        uint32_t afrl_a  = GPIO_AFRL(GPIOA_BASE);
        uint32_t moder_c = GPIO_MODER(GPIOC_BASE);
        uint32_t afrl_c  = GPIO_AFRL(GPIOC_BASE);
        uint32_t moder_g = GPIO_MODER(GPIOG_BASE);
        uint32_t afrh_g  = GPIO_AFRH(GPIOG_BASE);
        uint32_t moder_b = GPIO_MODER(GPIOB_BASE);
        uint32_t afrh_b  = GPIO_AFRH(GPIOB_BASE);
        uint32_t pmcr    = SYSCFG_PMCR;

        uart_puts("  GPIOA MODER: "); uart_puthex(moder_a);
        uart_puts("  AFRL: "); uart_puthex(afrl_a); uart_puts("\n");
        /* PA1: MODER[3:2]=10(AF), AFRL[7:4]=0xB(AF11) */
        uart_puts("    PA1 mode="); uart_puthex((moder_a >> 2) & 3);
        uart_puts(" af="); uart_puthex((afrl_a >> 4) & 0xF);
        uart_puts((((moder_a >> 2) & 3) == 2 && ((afrl_a >> 4) & 0xF) == 11) ?
                  " OK\n" : " WRONG!\n");
        /* PA2: MODER[5:4]=10, AFRL[11:8]=0xB */
        uart_puts("    PA2 mode="); uart_puthex((moder_a >> 4) & 3);
        uart_puts(" af="); uart_puthex((afrl_a >> 8) & 0xF);
        uart_puts((((moder_a >> 4) & 3) == 2 && ((afrl_a >> 8) & 0xF) == 11) ?
                  " OK\n" : " WRONG!\n");
        /* PA7: MODER[15:14]=10, AFRL[31:28]=0xB */
        uart_puts("    PA7 mode="); uart_puthex((moder_a >> 14) & 3);
        uart_puts(" af="); uart_puthex((afrl_a >> 28) & 0xF);
        uart_puts((((moder_a >> 14) & 3) == 2 && ((afrl_a >> 28) & 0xF) == 11) ?
                  " OK\n" : " WRONG!\n");

        uart_puts("  GPIOC MODER: "); uart_puthex(moder_c);
        uart_puts("  AFRL: "); uart_puthex(afrl_c); uart_puts("\n");
        /* PC1: MODER[3:2]=10, AFRL[7:4]=0xB */
        uart_puts("    PC1 mode="); uart_puthex((moder_c >> 2) & 3);
        uart_puts(" af="); uart_puthex((afrl_c >> 4) & 0xF);
        uart_puts((((moder_c >> 2) & 3) == 2 && ((afrl_c >> 4) & 0xF) == 11) ?
                  " OK\n" : " WRONG!\n");

        uart_puts("  GPIOB MODER: "); uart_puthex(moder_b);
        uart_puts("  AFRH: "); uart_puthex(afrh_b); uart_puts("\n");
        /* PB13: MODER[27:26]=10, AFRH[23:20]=0xB */
        uart_puts("    PB13 mode="); uart_puthex((moder_b >> 26) & 3);
        uart_puts(" af="); uart_puthex((afrh_b >> 20) & 0xF);
        uart_puts((((moder_b >> 26) & 3) == 2 && ((afrh_b >> 20) & 0xF) == 11) ?
                  " OK\n" : " WRONG!\n");

        uart_puts("  GPIOG MODER: "); uart_puthex(moder_g);
        uart_puts("  AFRH: "); uart_puthex(afrh_g); uart_puts("\n");
        /* PG11: MODER[23:22]=10, AFRH[15:12]=0xB */
        uart_puts("    PG11 mode="); uart_puthex((moder_g >> 22) & 3);
        uart_puts(" af="); uart_puthex((afrh_g >> 12) & 0xF);
        uart_puts((((moder_g >> 22) & 3) == 2 && ((afrh_g >> 12) & 0xF) == 11) ?
                  " OK\n" : " WRONG!\n");
        /* PG13: MODER[27:26]=10, AFRH[23:20]=0xB */
        uart_puts("    PG13 mode="); uart_puthex((moder_g >> 26) & 3);
        uart_puts(" af="); uart_puthex((afrh_g >> 20) & 0xF);
        uart_puts((((moder_g >> 26) & 3) == 2 && ((afrh_g >> 20) & 0xF) == 11) ?
                  " OK\n" : " WRONG!\n");

