wolfSSL/wolfip/src/port/stm32h753/main.c
        uart_puts("  SYSCFG_PMCR: "); uart_puthex(pmcr);
        uart_puts(" EPIS="); uart_puthex((pmcr >> 21) & 7);
        uart_puts((((pmcr >> 21) & 7) == 4) ? " (RMII OK)" : " (WRONG!)");
        uart_puts(" switches="); uart_puthex((pmcr >> 24) & 0xF);
        uart_puts((((pmcr >> 24) & 0xF) == 0) ? " (closed OK)\n" : " (OPEN!)\n");
    }

    /* Step 2: Wait for PHY REF_CLK to stabilize after board reset.
     * LAN8742A power-on reset takes up to 167ms. We wait 500ms to
     * be very safe. The MAC needs REF_CLK for register access. */
    uart_puts("Waiting 500ms for PHY REF_CLK stabilization...\n");
    delay(50000000);  /* ~500ms at 400MHz (~10ns per iteration) */

    /* Verify PA1 REF_CLK */
    {
        uint32_t pa1_samples = 0;
        int i;
        for (i = 0; i < 32; i++) {
            if (GPIO_IDR(GPIOA_BASE) & (1u << 1))
                pa1_samples |= (1u << i);
        }
        uart_puts("  PA1 (REF_CLK): "); uart_puthex(pa1_samples);
        uart_puts(pa1_samples == 0 ? " (ALL LOW!)\n" :
                   pa1_samples == 0xFFFFFFFF ? " (ALL HIGH!)\n" :
                   " (toggling OK)\n");
    }

    /* Step 3: Enable ETH clocks.
     * CRITICAL: ETH clock bits are 15,16,17 in AHB1ENR (NOT 25,26,27!)
     *   Bit 15: ETH1MACEN  (bus interface clock)
     *   Bit 16: ETH1TXEN   (TX clock, from REF_CLK in RMII)
     *   Bit 17: ETH1RXEN   (RX clock, from REF_CLK in RMII)
     * Bits 25-27 are USB OTG clocks - not ETH! */
    uart_puts("Enabling ETH clocks (bits 15,16,17)...\n");
    RCC_AHB1ENR |= (1u << 15) | (1u << 16) | (1u << 17);
    __asm volatile ("dsb sy" ::: "memory");
    delay(100000);  /* ~250us for clocks to stabilize */

    uart_puts("  RCC_AHB1ENR: "); uart_puthex(RCC_AHB1ENR); uart_puts("\n");
    uart_puts("  MACVR: "); uart_puthex(*(volatile uint32_t *)(0x40028110UL)); uart_puts("\n");

    /* Step 4: RCC reset ETH MAC (bit 15 in AHB1RSTR) */
    RCC_AHB1RSTR |= RCC_AHB1RSTR_ETHRST;
    __asm volatile ("dsb sy" ::: "memory");
    delay(100000);
    RCC_AHB1RSTR &= ~RCC_AHB1RSTR_ETHRST;
    __asm volatile ("dsb sy" ::: "memory");
    delay(4000000);  /* ~10ms post-reset stabilization */

    uart_puts("  Post-reset MACVR: "); uart_puthex(*(volatile uint32_t *)(0x40028110UL)); uart_puts("\n");
    uart_puts("  Post-reset DMAMR: "); uart_puthex(*(volatile uint32_t *)(0x40029000UL)); uart_puts("\n");

    uart_puts("Initializing Ethernet MAC...\n");
    ll = wolfIP_getdev(IPStack);
    ret = stm32h7_eth_init(ll, NULL);
    if (ret < 0) {
        uart_puts("  ERROR: stm32h7_eth_init failed (");
        uart_puthex((uint32_t)ret);
        uart_puts(")\n");
        led_red_on();
    } else {
        uart_puts("  PHY link: ");
        uart_puts((ret & 0x100) ? "UP" : "DOWN");
        uart_puts(", PHY addr: ");
        uart_puthex(ret & 0xFF);
        uart_puts("\n");
    }

    /* Debug: Read MDIO registers post-init (no DMA reset - preserve eth state) */
    uart_puts("MDIO Debug (post-init register state):\n");
    {
        volatile uint32_t *macmdioar = (volatile uint32_t *)(0x40028000UL + 0x0200U);
        volatile uint32_t *macmdiodr = (volatile uint32_t *)(0x40028000UL + 0x0204U);
        volatile uint32_t *maccr     = (volatile uint32_t *)(0x40028000UL + 0x0000U);
        volatile uint32_t *dmamr     = (volatile uint32_t *)(0x40028000UL + 0x1000U);
        uint32_t cfg, timeout;

        uart_puts("  MACCR:     "); uart_puthex(*maccr); uart_puts("\n");
        uart_puts("  DMAMR:     "); uart_puthex(*dmamr); uart_puts("\n");
        uart_puts("  MACMDIOAR: "); uart_puthex(*macmdioar); uart_puts("\n");
        uart_puts("  MACMDIODR: "); uart_puthex(*macmdiodr); uart_puts("\n");
        uart_puts("  RCC_AHB1ENR: "); uart_puthex(RCC_AHB1ENR); uart_puts("\n");
        uart_puts("  RCC_AHB2ENR: "); uart_puthex(RCC_AHB2ENR); uart_puts("\n");
        uart_puts("  SYSCFG_PMCR: "); uart_puthex(SYSCFG_PMCR); uart_puts("\n");

        /* Try MDIO read of PHY ID1 (reg 2) at address 0 */
        timeout = 100000;
        while ((*macmdioar & 1) && --timeout) {}
        uart_puts("  MB clear wait timeout_left="); uart_putdec(timeout); uart_puts("\n");

        cfg = (4U << 8) |     /* CR=4 for HCLK/102 (200MHz HCLK) */
              (2U << 16) |    /* RDA=2 (PHY_REG_ID1) */
              (0U << 21) |    /* PA=0 (PHY addr 0) */
              (3U << 2);      /* GOC=3 (read) */
        *macmdioar = cfg | 1; /* Set MB bit */
        uart_puts("  MACMDIOAR wrote: "); uart_puthex(cfg | 1);
        uart_puts(" readback: "); uart_puthex(*macmdioar); uart_puts("\n");

        timeout = 100000;
        while ((*macmdioar & 1) && --timeout) {}
        uart_puts("  MDIO op done, timeout_left="); uart_putdec(timeout); uart_puts("\n");
        uart_puts("  MACMDIOAR: "); uart_puthex(*macmdioar); uart_puts("\n");
        uart_puts("  MACMDIODR (ID1@0): "); uart_puthex(*macmdiodr); uart_puts("\n");

        /* Try PHY address 1 */
        timeout = 100000;
        while ((*macmdioar & 1) && --timeout) {}
        cfg = (4U << 8) | (2U << 16) | (1U << 21) | (3U << 2);
        *macmdioar = cfg | 1;
        timeout = 100000;
        while ((*macmdioar & 1) && --timeout) {}
        uart_puts("  MACMDIODR (ID1@1): "); uart_puthex(*macmdiodr); uart_puts("\n");
    }

#ifdef DHCP
    {
        uint32_t dhcp_start_tick;
        uint32_t dhcp_timeout = 30000;

        uart_puts("Calling dhcp_client_init...\n");
        ret = dhcp_client_init(IPStack);
        uart_puts("dhcp_client_init returned: "); uart_putdec((uint32_t)ret); uart_puts("\n");
        if (ret >= 0) {
            uart_puts("Waiting for DHCP...\n");
            dhcp_start_tick = tick;
            while (!dhcp_bound(IPStack)) {
                uint32_t elapsed = (uint32_t)(tick - dhcp_start_tick);
                if (elapsed == 0) uart_puts("  Entering poll loop...\n");
                (void)wolfIP_poll(IPStack, tick);
                if (elapsed == 0) uart_puts("  First poll done.\n");
                tick++;
                if ((elapsed < 10) ||
                    (elapsed % 2000) == 0) {
                    uint32_t polls, pkts;
                    stm32h7_eth_get_stats(&polls, &pkts);
                    uart_puts("  tick=");
                    uart_putdec(elapsed);
                    uart_puts(" rx_polls=");
                    uart_putdec(polls);
                    uart_puts(" rx_pkts=");
                    uart_putdec(pkts);
                    uart_puts(" DMACSR=");
                    uart_puthex(stm32h7_eth_get_dmacsr());
                    uart_puts(" des3=");
                    uart_puthex(stm32h7_eth_get_rx_des3());
                    uart_puts("\n");
                }
                delay(100000);  /* ~1ms at 400MHz SYSCLK */
                if (elapsed > dhcp_timeout)
                    break;
            }
            if (dhcp_bound(IPStack)) {
                ip4 ip = 0, nm = 0, gw = 0;
                wolfIP_ipconfig_get(IPStack, &ip, &nm, &gw);
                uart_puts("DHCP configuration received:\n");
                uart_puts("  IP: ");
                uart_putip4(ip);
                uart_puts("\n  Mask: ");
                uart_putip4(nm);
                uart_puts("\n  GW: ");
                uart_putip4(gw);
                uart_puts("\n");
            } else {
                uart_puts("DHCP timeout!\n");
            }
        }
    }
#else
    {
        ip4 ip = atoip4(WOLFIP_IP);
        ip4 nm = atoip4(WOLFIP_NETMASK);
        ip4 gw = atoip4(WOLFIP_GW);
        uart_puts("Using static IP configuration:\n");
        uart_puts("  IP: ");
        uart_putip4(ip);
        uart_puts("\n  Mask: ");
        uart_putip4(nm);
        uart_puts("\n  GW: ");
        uart_putip4(gw);
        uart_puts("\n");
        wolfIP_ipconfig_set(IPStack, ip, nm, gw);
    }
#endif

    /* Create TCP echo server on port 7 */
    uart_puts("Creating TCP echo server on port 7...\n");
    listen_fd = wolfIP_sock_socket(IPStack, AF_INET, IPSTACK_SOCK_STREAM, 0);
    wolfIP_register_callback(IPStack, listen_fd, echo_cb, IPStack);

